app/Controllers/CartController.php

SELECT *
FROM `products`
WHERE `products`.`id` = '1'
SELECT *
FROM `cart`
WHERE `user_id` = 1
AND `product_id` = '1'
 LIMIT 1
UPDATE `cart` SET `quantity` = 2, `total_price` = 1000
WHERE `cart`.`id` IN ('103')
---
    public function addToCart()
    {
        if ($this->request->isAJAX()) {
            $session = session();
            $productId = $this->request->getPost('product_id');
            $quantity = $this->request->getPost('quantity');
            $userId = 1;

            $productModel = new ProductModel();
            $cartModel = new CartModel();

            $product = $productModel->find($productId);

            if ($product) {
                $existingCartItem = $cartModel->where([
                    'user_id' => $userId,
                    'product_id' => $productId
                ])->first();

                if ($existingCartItem) {
                    $newQuantity = $existingCartItem['quantity'] + $quantity;
                    $newTotalPrice = $newQuantity * $product['price'];

                    $cartModel->update($existingCartItem['id'], [
                        'quantity' => $newQuantity,
                        'total_price' => $newTotalPrice,
                    ]);

DELETE FROM `cart`
WHERE `id` IN ('4')
---
    public function removeFromCart($productId)
    {
        if ($this->request->isAJAX()) {
            $session = session();
            $cartItems = $session->get('cart_items') ?? [];

            if (isset($cartItems[$productId])) {
                unset($cartItems[$productId]);

                $session->set('cart_items', $cartItems);

                $cartModel = new CartModel();
                $cartModel->where('product_id', $productId)->delete();