app/Controllers/ProductController.php

    public function view()
    {
        $productModel = new ProductModel();

        $data['products'] = $productModel->findAll();
---
SELECT *
FROM `products`

    public function display($id)
    {
        $productModel = new ProductModel();

        $product = $productModel->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '2'

    public function fetchProducts()
    {
        if ($this->request->isAJAX()) {
            $productModel = new ProductModel();

            $search = $this->request->getPost('search') ?? '';
            $category = $this->request->getPost('category') ?? '';
            $page = (int)($this->request->getPost('page') ?? 1);

            $perPage = 3;
            $offset = ($page - 1) * $perPage;

            $builder = $productModel->builder();

            if (!empty($search)) {
                $builder->like('product_name', $search);
            }

            if (!empty($category)) {
                $builder->where('category', $category);
            }

            $totalCount = $builder->countAllResults(false);
            $products = $builder->limit($perPage, $offset)->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `product_name` LIKE '%dress%' ESCAPE '!'
AND `category` = 'Women'
SELECT *
FROM `products`
WHERE `product_name` LIKE '%dress%' ESCAPE '!'
AND `category` = 'Women'
 LIMIT 3