app/Controllers/StripeController.php

            ]);

            $transactionModel = new TransactionModel();
            $transactionModel->insert([
                'order_id' => $orderId,
                'transaction_id' => $session->id,
                'payment_status' => 'pending',
                'payment_method' => 'stripe',
                'created_at' => date('Y-m-d H:i:s'),
            ]);
---
INSERT INTO `transactions` (`order_id`, `transaction_id`, `payment_status`, `payment_method`, `created_at`, `updated_at`) VALUES (120, 'cs_test_a1V6hVetYzdjYglaCppSR669g2p38p3yPgHPd2HlAilUQgHxl6z4g1WrHY', 'pending', 'stripe', '2024-12-26 12:59:59', '2024-12-26 12:59:59')