app/Models/CheckoutModel.php

    public function insertOrder($orderData, $cartItems)
    {
        $db = \Config\Database::connect();

        $this->insert($orderData);
        $orderId = $this->insertID();
---
INSERT INTO `orders` (`user_id`, `city`, `fname`, `lname`, `address`, `email`, `phone`, `notes`, `total_amt`) VALUES ('1', 'USA', 'kittu', 'kalsariya', 'hjpop', 'staff4@gmail.com', '1234567890', 'htfghgjfjghjhg', '2200')