app/Models/TransactionModel.php

UPDATE `transactions` SET `payment_status` = 'completed', `transaction_id` = 'PAYID-M5WPPFQ5WH06876HE461183J', `updated_at` = '2024-12-26 06:29:36'
WHERE `transaction_id` = 'PAYID-M5WPPFQ5WH06876HE461183J'
---
    public function updateStatus($paymentId, $data)
    {
        return $this->where('transaction_id', $paymentId)
                    ->set($data)
                    ->update();